app/views/posts/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 16
SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 21
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 21
---

<% if @post.comments.count != 0 %>
    <div class="row">
            <% @post.comments.each do |comment| %>