app/controllers/comments_controller.rb

INSERT INTO `comments` (`title`, `created_at`, `updated_at`, `post_id`, `user_id`) VALUES ('hey', '2020-03-26 21:11:49.544603', '2020-03-26 21:11:49.544603', 16, 1)
---
def create
    @comment = Comment.new(comment_params)
    respond_to do |format|
    if @comment.save

DELETE FROM `comments` WHERE `comments`.`id` = 11
---
def destroy
    @comment.destroy