app/controllers/comments_controller.rb

    def destroy
        @comment = Comment.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 11 LIMIT 1