app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY created_at DESC
---
    def index
      @posts = Post.all.order("created_at DESC")

INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`, `user_id`) VALUES ('hey1', 'hey hey hey', '2020-03-26 21:50:34.752917', '2020-03-26 21:50:34.752917', 1)
---
    def create
      @post = Post.new(post_params)
        if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 16 LIMIT 1
UPDATE `posts` SET `posts`.`body` = 'hey3', `posts`.`updated_at` = '2020-03-26 20:32:34.614529' WHERE `posts`.`id` = 16
---
    def update
      @post = Post.find(params[:id])
      respond_to do |format|
        if @post.update_attributes(post_params)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 16 LIMIT 1
---
      def set_Post
        @post = Post.find(params[:id])