app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `name`, `password`, `created_at`, `updated_at`) VALUES ('123', '123', '123', '2020-03-26 12:30:52.047600', '2020-03-26 12:30:52.047600')
---
    def create
      @user = User.new(user_params)
      respond_to do |format|
        if @user.save